# 나누어 입력받기
a, b = map(int, input().split)


# # 나누어 입력받기 빠른 버전
import sys

a, b = map(int, sys.stdin.readline().split)


# 입출력 가속
import sys

N = int(sys.stdin.readline())
sys.stdout.write(N)


# 더 빠른 방법
from sys import stdin, stdout

input = stdin.readline
print = stdout.write

####################################################################
# 배열 입력 방법
# ex
# 3
# 1 2 3
# 4 5 6
# 7 8 9

# bad code
for i in range(int(input())):
    inputStr = input()
    arr = list(inputStr)
    MAP.append(arr)

# good code
MAP = [list(map(int, input().split())) for _ in range(int(input()))]
####################################################################


####################################################################
#정수와 배열이 같은 줄에 들어오는 경우
#ex
#4 10 20 30 40
#3 7 5 12
#3 125 15 25
N, *arr = map(int, input().split())
# arr변수 앞에 *를 붙이면 뒤이어 나오는 값이 arr에 배열로 저장
####################################################################


####################################################################
# 문자열을 한 글자씩 배열에 저장
# ex
# 3
# AAAA
# ABCA
# AAAA
# Wrong code
arr = [input() for _ in range(N)]
# => arr = ['AAAA', "ABCA', 'AAAA']

# Good Code
arr = [list(input()) for _ in range(N)]
####################################################################


####################################################################
# 배열을 연결해서 출력 1
arr = [1, 2, 3, 4]
print("".join(map(str, arr)))
# map함수를 이용, arr에 저장되어 있는 정수의 값을 string형식으로 변환, 그 다음 "".join을 이용, 공백 없이 출력
####################################################################


####################################################################
# 배열을 연결해서 출력 2
arr = [1,2,3,4]
# 1 2 3 4로 출력하는 법
# print(*arr)
####################################################################
